#불리언 타입(boolean types):bool
불리언 타입이란 논리값인 참(True)과 거짓(False) 중 한 가지만을 가질 수 있는 데이터 타입을 의미합니다.
C를 비롯한 대부분의 프로그래밍 언어에서 1은 '참'을 의미하고 0은 '거짓'을 의미합니다.
문자열이나 리스트, 튜플, 딕셔너리 등이 비어있으면 거짓(False)으로 인식되며, 비어있지 않으면 참(True)
으로 인식됩니다.

#비교 연산자(relational operator)
비교 연산자는 피연산자 사이의 상대적인 크기를 판단하는 연산자로, 왼쪽의 피연산자와 오른쪽의 피연산자를
서로 비교하여 어느 쪽이 더 큰지, 작은지 같은지를 판단합니다.
<, >, <=, >, >=, ==,
!= 왼쪽의 피연산자와 오른쪽의 피연산자가 같지 않으면 True를 반환함.

#논리 연산자(logical operator)
논리 연산자는 주어진 논리식을 판단하여, 참(True)과 거짓(Fales)을 결정하는 연산자입니다.
or 논리식 중에서 하나라도 True이면 True를 반환함.
and 논리식이 모두 True이면 True를 반환함.
not 논리식의 결과가 True이면 False를, False이면 True를 반환함.
